import type { IGame } from "../types/interfaces";

export const ALL_GAMES_TAB = 'Всі Ігри' as const;

export const MOCK_GAMES: IGame[] = [
    { 
        id: '1',
        title: 'Занепад сузір’я D64',
        minPlayersCount: 2,
        maxPlayersCount: 5,
        complexity: 'Легкий',
        category: 'Пригодне',
        imageSmall: '/games/game-1.png',
        imageLarge: '/games/game-1-large.jpg',
        description: "Гра \"Занепад сузір’я D64\" - це настільна гра для 3-7 гравців, які керують космічними експедиціями на планеті, де колись існувала високорозвинена цивілізація. Гравці повинні знайти та дослідити залишки цивілізації, зібрати різноманітні артефакти та з'ясувати, що сталося з цією цивілізацією. Гравці отримують картки зі слідами цивілізації та виконують різні місії, щоб дізнатися більше про історію планети. Гра також містить елементи стратегії, оскільки гравці повинні приймати рішення про те, які області досліджувати та які ресурси використовувати, щоб знайти артефакти та розв'язати загадки. Переможцем стає той, хто збирає найбільшу кількість артефактів та вирішує загадки цивілізації.",
        time: "120хв",
     },
     { 
        id: '2',
        title: 'Занепад сузір’я D64',
        minPlayersCount: 2,
        maxPlayersCount: 5,
        complexity: 'Легкий',
        category: 'Хорор',
        imageSmall: '/games/game-2.png',
        imageLarge: '/games/game-2-large.jpg',
        description: "Гра \"Занепад сузір’я D64\" - це настільна гра для 3-7 гравців, які керують космічними експедиціями на планеті, де колись існувала високорозвинена цивілізація. Гравці повинні знайти та дослідити залишки цивілізації, зібрати різноманітні артефакти та з'ясувати, що сталося з цією цивілізацією. Гравці отримують картки зі слідами цивілізації та виконують різні місії, щоб дізнатися більше про історію планети. Гра також містить елементи стратегії, оскільки гравці повинні приймати рішення про те, які області досліджувати та які ресурси використовувати, щоб знайти артефакти та розв'язати загадки. Переможцем стає той, хто збирає найбільшу кількість артефактів та вирішує загадки цивілізації.",
        time: "120хв",
     },
  ];
